wisteria-1c/Конфигурация/InformationRegisters/ИндексыСПАРКРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИндексыСПАРКРиски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОшибокСПАРКРиски</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексДолжнойОсмотрительности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексПлатежнойДисциплины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексФинансовогоРиска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьСтатус</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СводныйИндикатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСобытийСПАРКРиски</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БухгалтерскаяОтчетность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусНазвание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЗначениеНовое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЗначениеСтарое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИдентификаторСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИдентификаторТипаСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКодСтатуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТекстСтатуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБИП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/InformationRegisters/ИндексыСПАРКРиски/Forms/ПросмотрИндексовКонтрагента/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИндексыСПАРКРиски = Параметры.ИндексыСПАРКРиски;
	Заголовок = НСтр("ru = '1СПАРК Риски:'") + " " + Строка(ИндексыСПАРКРиски.Контрагент);
	
	ОтобразитьЗначенияИндексов(Параметры.ИндексыСПАРКРиски);
	
	КлючСохраненияПоложенияОкна = Строка(Элементы.ДекорацияСтатусИСобытие.Видимость)
		+ Строка(Элементы.ГруппаСводныйИндикатор.Видимость)
		+ Строка(Элементы.ГруппаИДО.Видимость)
		+ Строка(Элементы.ГруппаИФР.Видимость)
		+ Строка(Элементы.ГруппаИПД.Видимость)
		+ Строка(Элементы.ГруппаОшибкаПодключенияКСервису.Видимость);
		
	// Интерфейс85
	Если Не ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85() Тогда
		
		Элементы.ГруппаСводныйИндикатор.ОтображатьЗаголовок = Ложь;
		Элементы.ГруппаИФР.ОтображатьЗаголовок = Ложь;
		Элементы.ГруппаИДО.ОтображатьЗаголовок = Ложь;
		Элементы.ГруппаИПД.ОтображатьЗаголовок = Ложь;
		
		Элементы.ГруппаСводныйИндикатор.Высота = 12;
		Элементы.ГруппаИФР.Высота = 0;
		Элементы.ГруппаИДО.Высота = 0;
		Элементы.ГруппаИПД.Высота = 12;
		
		Элементы.ДекорацияСводныйИндикатор.Видимость = Истина;
		Элементы.ДекорацияИФР.Видимость = Истина;
		Элементы.ДекорацияИДО.Видимость = Истина;
		Элементы.ДекорацияИПД.Видимость = Истина;
		
		Элементы.ФормаЗакрыть.Видимость = Истина;
		
	КонецЕсли;
	// Конец Интерфейс85
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "СПАРКРиски:ИзмененоСостояниеФоновогоЗадания"
		И Параметр.Статус = "Выполнено" Тогда
		
		ОтобразитьРезультатыФоновогоЗадания(Параметр.АдресХранилищаФоновогоЗадания);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияОписаниеОшибкиОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если НавигационнаяСсылкаФорматированнойСтроки = "SPARK:About" Тогда
		СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(
			ЭтотОбъект,
			Элемент,
			НавигационнаяСсылкаФорматированнойСтроки,
			СтандартнаяОбработка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьРезультатыФоновогоЗадания(Знач АдресХранилища)

	Результаты = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если Результаты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаРезультат = Результаты.ЗначенияИндексов.Найти(ИндексыСПАРКРиски.ИНН, "ИНН");
	Если СтрокаРезультат <> Неопределено Тогда
		ИндексыСПАРКРиски = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаРезультат);
		ИндексыСПАРКРиски.Вставить(
			"СостояниеВыводаДанных",
			ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ПолученоИзФоновогоЗадания"));
		ИндексыСПАРКРиски.Вставить(
			"СостояниеЗагрузкиДанных",
			ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ПустаяСсылка"));
		ОтобразитьЗначенияИндексов(ИндексыСПАРКРиски);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтобразитьЗначенияИндексов(РезультатИндексыКонтрагента)

	ЦветаСтилей = СПАРКРискиКлиентСервер.ЦветаСтилей();
	Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость = Ложь;

	Элементы.ДекорацияСтатусИСобытие.Видимость  = Ложь;
	Элементы.ДекорацияСтатусИСобытие.ЦветТекста = ЦветаСтилей.ЦветОсобогоТекста;
	Элементы.ГруппаСводныйИндикатор.Видимость   = Ложь;
	Элементы.ГруппаИДО.Видимость = Ложь;
	Элементы.ГруппаИФР.Видимость = Ложь;
	Элементы.ГруппаИПД.Видимость = Ложь;
	Элементы.ГруппаОшибкаПодключенияКСервису.Видимость = Ложь;

	ВидОшибки               = РезультатИндексыКонтрагента.ВидОшибки;
	СостояниеВыводаДанных   = РезультатИндексыКонтрагента.СостояниеВыводаДанных;
	СостояниеЗагрузкиДанных = РезультатИндексыКонтрагента.СостояниеЗагрузкиДанных;

	Если Не ЗначениеЗаполнено(ВидОшибки) Тогда

		// Отображение данных.
		ОшибкаПолученияДанных = Ложь;

		ТекстОшибки = "";
		Если СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.ВКэшеНетДанных") Тогда

			ОшибкаПолученияДанных = Истина;
			Если СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ЗапущеноФоновоеЗадание") Тогда
				ТекстОшибки = НСтр("ru='Получение данных...'");
			ИначеЕсли СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ОтменаФоновогоЗадания") Тогда
				ТекстОшибки = НСтр("ru='Ошибка получения данных (слишком медленное соединение или отменено администратором)'");
			ИначеЕсли СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ОшибкаФоновогоЗадания") Тогда
				ТекстОшибки = НСтр("ru='Ошибка получения данных'");
			Иначе // Загрузка завершена или не осуществлялась.
				ТекстОшибки = НСтр("ru='Ошибка получения данных (данные не получены)'");
			КонецЕсли;

		ИначеЕсли СостояниеВыводаДанных = ПредопределенноеЗначение("Перечисление.СостоянияВыводаИндексовСПАРКРиски.НеправильныйИНН") Тогда

			ОшибкаПолученияДанных = Истина;
			ТекстОшибки = НСтр("ru='Нет информации о контрагенте'");

		ИначеЕсли Не ЗначениеЗаполнено(СостояниеВыводаДанных) Тогда

			ОшибкаПолученияДанных = Истина;
			ТекстОшибки = НСтр("ru='Неопределенная ошибка'");

		КонецЕсли;

		Если СостояниеЗагрузкиДанных = ПредопределенноеЗначение("Перечисление.СостоянияЗагрузкиИндексовСПАРКРиски.ЗапущеноФоновоеЗадание") Тогда
			Элементы.КартинкаОжиданиеЗагрузкиИндексовСПАРКРиски.Видимость = Истина;
		КонецЕсли;

		Если ОшибкаПолученияДанных = Истина Тогда
			Элементы.ДекорацияСтатусИСобытие.Заголовок = ТекстОшибки;
			Элементы.ДекорацияСтатусИСобытие.Видимость = Истина;
			Возврат;
		КонецЕсли;

		Если (РезультатИндексыКонтрагента.Активен <> Истина) Тогда
			Элементы.ДекорацияСтатусИСобытие.Заголовок =
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Контрагент прекратил деятельность %1'"),
					Формат(РезультатИндексыКонтрагента.ДатаСтатуса, "ДЛФ=D"));
			Элементы.ДекорацияСтатусИСобытие.Видимость = Истина;
			Возврат;
		КонецЕсли;

		Если РезультатИндексыКонтрагента.ОтображатьСтатус
				И НЕ ПустаяСтрока(РезультатИндексыКонтрагента.СтатусНазвание) Тогда
			Элементы.ДекорацияСтатусИСобытие.Заголовок =
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='%1 %2'"),
					РезультатИндексыКонтрагента.СтатусНазвание,
					Формат(РезультатИндексыКонтрагента.ДатаСтатуса, "ДЛФ=D"));
			Элементы.ДекорацияСтатусИСобытие.Видимость = Истина;
		КонецЕсли;

		Если (РезультатИндексыКонтрагента.СводныйИндикатор >= 1)
				И (РезультатИндексыКонтрагента.СводныйИндикатор <= 3) Тогда
			
			Элементы.ГруппаСводныйИндикатор.Видимость = Истина;
			ИмяЦвета = СПАРКРискиКлиентСервер.ИмяЦветаИндекса(
				РезультатИндексыКонтрагента.СводныйИндикатор,
				"СводныйИндикатор");
			ШаблонСтроки = НСтр("ru='<span style=""color:" + ИмяЦвета + """>%1</span>'");
			Элементы.ДекорацияСводныйИндикаторЗначение.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				ШаблонСтроки,
				РезультатИндексыКонтрагента.СводныйИндикаторГрадация);
			
		КонецЕсли;
		
		Если (РезультатИндексыКонтрагента.ИндексДолжнойОсмотрительности >= 0)
				И (РезультатИндексыКонтрагента.ИндексДолжнойОсмотрительности <= 100) Тогда
			
			Элементы.ГруппаИДО.Видимость = Истина;
			ИмяЦвета = СПАРКРискиКлиентСервер.ИмяЦветаИндекса(
				РезультатИндексыКонтрагента.ИндексДолжнойОсмотрительности,
				"ИндексДолжнойОсмотрительности");
			ШаблонСтроки = НСтр("ru='<span style=""color:" + ИмяЦвета + """>%1 (%2)</span>'");
			Элементы.ДекорацияИДОЗначение.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				ШаблонСтроки,
				РезультатИндексыКонтрагента.ИндексДолжнойОсмотрительности,
				НРег(РезультатИндексыКонтрагента.ИДОГрадация));
			
		КонецЕсли;

		Если (РезультатИндексыКонтрагента.ИндексФинансовогоРиска >= 0)
				И (РезультатИндексыКонтрагента.ИндексФинансовогоРиска <= 100) Тогда
			
			Элементы.ГруппаИФР.Видимость = Истина;
			ИмяЦвета = СПАРКРискиКлиентСервер.ИмяЦветаИндекса(
				РезультатИндексыКонтрагента.ИндексФинансовогоРиска,
				"ИндексФинансовогоРиска");
			ШаблонСтроки = НСтр("ru='<span style=""color:" + ИмяЦвета + """>%1 (%2)</span>'");
			Элементы.ДекорацияИФРЗначение.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				ШаблонСтроки,
				РезультатИндексыКонтрагента.ИндексФинансовогоРиска,
				НРег(РезультатИндексыКонтрагента.ИФРГрадация));
			
		КонецЕсли;

		Если (РезультатИндексыКонтрагента.ИндексПлатежнойДисциплины >= 0)
				И (РезультатИндексыКонтрагента.ИндексПлатежнойДисциплины <= 100) Тогда
			
			Элементы.ГруппаИПД.Видимость = Истина;
			ИмяЦвета = СПАРКРискиКлиентСервер.ИмяЦветаИндекса(
				РезультатИндексыКонтрагента.ИндексПлатежнойДисциплины,
				"ИндексПлатежнойДисциплины");
			ШаблонСтроки = НСтр("ru='<span style=""color:" + ИмяЦвета + """>%1 (%2)</span>'");
			Элементы.ДекорацияИПДЗначение.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
				ШаблонСтроки,
				РезультатИндексыКонтрагента.ИндексПлатежнойДисциплины,
				НРег(РезультатИндексыКонтрагента.ИПДГрадация));
			
		КонецЕсли;

	ИначеЕсли ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НеизвестныйИНН")
		Или ВидОшибки = ПредопределенноеЗначение("Перечисление.ВидыОшибокСПАРКРиски.НекорректныйИНН") Тогда

		Элементы.ДекорацияСтатусИСобытие.Заголовок = НСтр("ru='Нет информации о контрагенте'");
		Элементы.ДекорацияСтатусИСобытие.Видимость = Истина;

	Иначе

		Элементы.ГруппаОшибкаПодключенияКСервису.Видимость = Истина;

		// Ошибка подключения.
		Элементы.ДекорацияОписаниеОшибки.Заголовок =
			СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru='Оценка надежности контрагентов.
				|
				|<a href=""SPARK:About"">Подробнее о сервисе</a>'"));

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
